Revit 2027 API
BuiltInFailures.MEPSupportFailures.TypeSizeNotMatchWithHostError Property
 The [Symbol] does not match the size of the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TypeSizeNotMatchWithHostError { get; }
Public Shared ReadOnly Property TypeSizeNotMatchWithHostError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TypeSizeNotMatchWithHostError {
	FailureDefinitionId^ get ();
}
static member TypeSizeNotMatchWithHostError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPSupportFailures Class
Autodesk.Revit.DB Namespace